# YOLOv10s + P2 Head
nc: 27
scales:
  s: [0.33, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12 cat P4
  - [-1, 3, C2f, [512]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat P3
  - [-1, 3, C2f, [256]] # 16 (P3 output)

  # Added P2 Head
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 2], 1, Concat, [1]] # 18 cat P2 (Backbone layer 2)
  - [-1, 3, C2f, [128]] # 19 (P2 output)

  - [-1, 1, Conv, [128, 3, 2]] # 20
  - [[-1, 16], 1, Concat, [1]] # 21
  - [-1, 3, C2f, [256]] # 22

  - [-1, 1, Conv, [256, 3, 2]] # 23
  - [[-1, 13], 1, Concat, [1]] # 24
  - [-1, 3, C2f, [512]] # 25

  - [-1, 1, SCDown, [512, 3, 2]] # 26
  - [[-1, 10], 1, Concat, [1]] # 27
  - [-1, 3, C2fCIB, [1024, True, True]] # 28

  - [[19, 22, 25, 28], 1, v10Detect, [nc]] # Detect(P2, P3, P4, P5)
