# Parameters
#YOLOv10s——Dynaimic summary: 503 layers, 6264278 parameters, 6264262 gradients, 22.1 GFLOPs
#改进前：YOLOv10s summary: 402 layers, 8087250 parameters, 8087234 gradients, 24.9 GFLOPs

nc: 27 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 16 (P3/8-small)

  - [[16, 13, 10, 7], 1, DynamicWeightedBiFPN, [128, 2, 2, 1, true, true, true, 4]] # DW-BiFPN over P2-P5
  - [17, 1, FeatureSelect, [0]] # P2/4
  - [-1, 1, SimAM, []]
  - [17, 1, FeatureSelect, [1]] # P3/8
  - [-1, 1, SimAM, []]
  - [17, 1, FeatureSelect, [2]] # P4/16
  - [-1, 1, SimAM, []]
  - [17, 1, FeatureSelect, [3]] # P5/32
  - [-1, 1, SimAM, []]
  - [[19, 21, 23, 25], 1, v10Detect, [nc]] # Detect(P2, P3, P4, P5)
